{
  "architectures": [
    "Enformer"
  ],
  "attn_dim_key": 64,
  "attn_dropout": 0.05,
  "depth": 11,
  "dim": 1536,
  "dim_divisible_by": 128,
  "dropout_rate": 0.4,
  "heads": 8,
  "model_type": "enformer",
  "num_downsamples": 7,
  "output_heads": {
    "human": 5313,
    "mouse": 1643
  },
  "pos_dropout": 0.01,
  "target_length": 32,
  "torch_dtype": "float32",
  "transformers_version": "4.16.2",
  "use_checkpointing": false
}